club(севілья):- is_true("Іспанський"), is_true("Вищий дивізіон"), is_true("Чемпіон єврокубків"), is_true("Топ-5 ліга").
club(сарбрюккен):- is_true("Німецький"), is_true("Третій дивізіон").
club(селтік):- is_true("Шотландський"), is_true("Вищий дивізіон"), is_true("Чемпіон єврокубків").
club(саутгемптон) :- is_true("Англійський"), is_true("Чемпіоншип").
club(сантос) :- is_true("Бразильський"), is_true("Вищий дивізіон").
club(спортінг) :- is_true("Португальський"), is_true("Вищий дивізіон").
club(стокСіті):- is_true("Англійський"), is_true("Чемпіоншип"), is_true("2 найстаріший клуб у англії").
club(свонсі):- is_true("Валійський"), is_true("Чемпіоншип").
is_true(Q) :-
        format("~s?\n", [Q]),
        read(yes).